def t():

    s = {"Австриа": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Франция": "Париж", "Белоруссия": "Минск", "Сербия": "Белград"}
    print(s)
    print(s["Франция"])
    for i in sorted (s):
        print(i, "-", s[i])

t()

def r():

    a = {
        "а": 1,
        "в": 1,
        "е": 1,
        "и": 1,
        "н": 1,
        "о": 1,
        "р": 1,
        "с": 1,
        "т": 1,
        "д": 2,
        "к": 2,
        "л": 2,
        "м": 2,
        "п": 2,
        "у": 2,
        "б": 3,
        "г": 3,
        "ё": 3,
        "ь": 3,
        "я": 3,
        "й": 4,
        "ы": 4,
        "ж": 5,
        "з": 5,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ю": 8,
        "э": 8,
        "ш": 8,
        "щ": 10,
        "ф": 10,
        "ъ": 10,
    }
    s = input('Введите слово: ')
    v = 0
    for i in s:
        v += (a[i])
    print(v)
r()

def h():


    stu = {"артемий":"английский" "китайский" "французский",
           "иван": "итальянский" "немецкий" "английский",
           "анастасия": "китайский" "английский" "французский",
           "влад":"английский""испаниский""китайский"
           }
    a = []
    b = []
    c = []
    for i in stu:
        k = stu[i.lower()].split(" ")
        for h in k:
            c.append(h)
            if h == "китайский":
                b.append(i)
        a = sorted(set(c))

    print('Студенты знают ' + str(len(a)) + ' языков:')
    print(a)
    print('Студенты, которые знают китайский:')
    print(b)


h()
